cf/InformationRegisters/нсиБуферФоновыхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>нсиБуферФоновыхЗаданий</Name>
			<Comment>Используется при расширенном поиске для неточного сравнения</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПризнакДляСвязи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакУникальности</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/нсиБуферФоновыхЗаданий/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура - записывает данные для признака, формирует УИН.
//
Процедура ЗаписьДанных(ПризнакДляСвязи, Данные) Экспорт
	
	ПризнакУникальности = Новый УникальныйИдентификатор;	
	
	НаборЗаписи = РегистрыСведений.нсиБуферФоновыхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.ПризнакДляСвязи.Установить(ПризнакДляСвязи);
	НаборЗаписи.Отбор.ПризнакУникальности.Установить(ПризнакУникальности);
	
	ЗаписьВБуфер = НаборЗаписи.Добавить();
	ЗаписьВБуфер.ПризнакДляСвязи = ПризнакДляСвязи;
	ЗаписьВБуфер.ПризнакУникальности = ПризнакУникальности;
	ЗаписьВБуфер.Данные = Данные;
	
	Попытка
		НаборЗаписи.Записать(Истина);
	Исключение
		ЗаписьДанных(ПризнакДляСвязи, Данные);
	КонецПопытки;
	
КонецПроцедуры	

// Процедура - считывает данные по признаку.
//
Функция ПрочитатьДанные(ПризнакДляСвязи) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	нсиБуферФоновыхЗаданий.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.нсиБуферФоновыхЗаданий КАК нсиБуферФоновыхЗаданий
	|ГДЕ
	|	нсиБуферФоновыхЗаданий.ПризнакДляСвязи = &ПризнакДляСвязи");
	
	Запрос.УстановитьПараметр("ПризнакДляСвязи", ПризнакДляСвязи);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Данные");
	
КонецФункции	

// Процедура - очищает данные по признаку.
//
Функция ОчиститьДанные(ПризнакДляСвязи) Экспорт
	
	НаборЗаписи = РегистрыСведений.нсиБуферФоновыхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.ПризнакДляСвязи.Установить(ПризнакДляСвязи);
	
	НаборЗаписи.Записать(Истина);
	
КонецФункции	

#КонецОбласти
